Autodesk.Revit.DB.ViewCropRegionShapeManager.GetCropRegionShape
Gets the crop region boundaries.
Returns:
The crop region boundaries.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to manage crop region shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveSplit
Removes split settings of crop region.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Crop region is not split.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveCropRegionShape
Removes boundaries of crop region.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to manage crop region shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.SetCropRegionEmptyShape
Sets crop region of empty shape making possible interactive sketching.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to manage crop region shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.SetCropRegionShape(Autodesk.Revit.DB.CurveLoop)
Sets boundaries of crop region.
boundaries:
The crop region boundaries.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Boundaries in boundaries should represent one closed curve loop without self-intersections,
consisting of non-zero length straight lines in plane parallel to the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is not allowed to manage crop region shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.IsCropRegionShapeValid(Autodesk.Revit.DB.CurveLoop)
Verifies that boundaries represent one closed curve loop without self-intersections,
consisting of non-zero length straight lines in plane parallel to the view plane.
Curves in boundaries use model coordinates.
boundaries:
The crop region boundaries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.ShapeSet
Verifies that view has crop region shape set.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.Split
Verifies that view crop region is split.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.Valid
Verifies that view is allowed to manage crop region shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager
Provides access to view crop region shape settings.
Remarks:
Can be obtained from view or reference callout.
Since:
2014